-- avtorebi
insert into authors (firstname, lastname, bio, birthdate) values
(N'ჯორჯ', N'ორუელი', N'ბრიტანელი მწერალი', '1903-06-25'),
(N'აგათა', N'კრისტი', N'ინგლისელი ავტორი', '1890-09-15'),
(N'სტივენ', N'კინგი', N'ამერიკელი მწერალი', '1947-09-21'),
(N'ერნესტ', N'ჰემინგუეი', N'ამერიკელი ავტორი', '1899-07-21'),
(N'ფიოდორ', N'დოსტოევსკი', N'რუსი ავტორი', '1821-11-11'),
(N'ალბერ', N'კამიუ', N'ფრანგი მწერალი', '1913-11-07'),
(N'გაბრიელ', N'გარსია მარკესი', N'კოლუმბიელი ავტორი', '1927-03-06'),
(N'ჰერმან', N'ჰესე', N'გერმანელი ავტორი', '1877-07-02'),
(N'ფრანც', N'კაფკა', N'ჩეხი მწერალი', '1883-07-03'),
(N'მარკ', N'ტვენი', N'ამერიკელი ავტორი', '1835-11-30'),
(N'ჩარლზ', N'დიკენსი', N'ინგლისელი მწერალი', '1812-02-07'),
(N'შოთა', N'რუსთაველი', N'ქართველი პოეტი', '1172-01-01'),
(N'ილია', N'ჭავჭავაძე', N'ქართველი მწერალი', '1837-10-27'),
(N'ვაჟა', N'ფშაველა', N'ქართველი მწერალი', '1861-07-26'),
(N'გალაკტიონ', N'ტაბიძე', N'ქართველი პოეტი', '1892-11-17'),
(N'აკაკი', N'წერეთელი', N'ქართველი მწერალი', '1840-06-09'),
(N'ნოდარ', N'დუმბაძე', N'ქართველი ავტორი', '1928-07-14'),
(N'მიხეილ', N'ჯავახიშვილი', N'ქართველი ავტორი', '1880-11-08');



--categoriebi
insert into categories (categoryname) values
(N'ფენტეზი'),
(N'კლასიკა'),
(N'დრამა'),
(N'ფსიქოლოგიური'),
(N'რომანი'),
(N'საომარი'),
(N'ბიოგრაფია'),
(N'მეცნიერება'),
(N'დეტექტივი'),
(N'ჰორორი'),
(N'კრიმინალი'),
(N'ნოველა'),
(N'სათავგადასავლო'),
(N'პოეზია');



--wignebi
insert into books (title, authorid, publicationdate, price, getprice, categoryid, quantity, descript) values
(N'1984', 1, '1949-06-08', 18.00, 15.00, 2, 10, N'დისტოპიური რომანი ტოტალიტარიზმზე.'), 
(N'მკვლელობა აღმოსავლეთის ექსპრესში', 2, '1934-01-01', 16.00, 14.00, 1, 8, N'დეტექტიური გამოძიება მატარებელში.'), 
(N'ბრწყინვალება', 3, '1977-01-28', 20.00, 18.00, 6, 5, N'საშინელება და ფსიქოლოგიური დაძაბულობა.'), 
(N'დანაშაული და სასჯელი', 5, '1866-01-01', 21.00, 18.50, 5, 6, N'ფსიქოლოგიური რომანი მორალზე.'), 
(N'მარტოობის ასი წელიწადი', 7, '1967-06-05', 22.00, 19.00, 3, 10, N'მაგიური რეალიზმი და ოჯახის ისტორია.'), 
(N'პროცესი', 9, '1925-04-26', 17.00, 15.00, 4, 5, N'ადამიანის ბრძოლა გაუგებრ ბიუროკრატიასთან.'), 
(N'ჰეკლბერი ფინის თავგადასავალი', 10, '1884-12-10', 16.00, 14.00, 7, 9, N'მოგზაურობა მდინარეზე და თავისუფლების ძიება.'), 
(N'ვეფხისტყაოსანი', 12, '1200-01-01', 25.00, 22.00, 8, 10, N'მშვენიერება, სიყვარული და რაინდობა.'), 
(N'ალუდა ქეთელაური', 14, '1888-01-01', 12.00, 10.00, 5, 4, N'გმირობა და ღირსება მთის თემაში.'), 
(N'მგზავრი', 15, '1924-01-01', 13.50, 11.50, 5, 6, N'მელანქოლიური ლექსები ცხოვრებაზე.'), 
(N'პოემები', 16, '1875-01-01', 11.00, 9.50, 7, 4, N'ლირიკული და პატრიოტული პოეზია.'), 
(N'მე, ბებია, ილიკო და ილარიონი', 17, '1960-01-01', 15.00, 13.00, 6, 8, N'სიცილი და გულწრფელი სევდა სოფლიდან.'), 
(N'ჯაყოს ხიზნები', 18, '1924-01-01', 17.00, 15.00, 5, 6, N'სოციოპოლიტიკური ტრაგედია და ქართული რეალობა.');
